<template>
  <div class="">
    <h1>СОГЛАШЕНИЕ НА ОБРАБОТКУ ПЕРСОНАЛЬНЫХ ДАННЫХ</h1>
    <div class="q-mb-md">
      Настоящим в соответствии с Федеральным законом № 152-ФЗ «О персональных данных» от
      27.07.2006 года Вы подтверждаете свое согласие на обработку сервисом «Я<q-icon
        name="favorite"
        color="red"
      />ОФП» персональных данных: сбор, систематизацию, накопление, хранение, уточнение
      (обновление, изменение), использование, передачу исключительно в целях продажи
      программного обеспечения на Ваше имя, как это описано ниже, блокирование,
      обезличивание, уничтожение.
    </div>
    <div class="q-my-md">
      Сервис «Я<q-icon name="favorite" color="red" />ОФП» гарантирует конфиденциальность
      получаемой информации. Обработка персональных данных осуществляется в целях
      эффективного исполнения заказов, договоров и иных обязательств, принятых сервисом
      «Я<q-icon name="favorite" color="red" />ОФП» в качестве обязательных к исполнению.
    </div>
    <div class="q-my-md">
      В случае необходимости предоставления Ваших персональных данных правообладателю,
      дистрибьютору или реселлеру программного обеспечения в целях регистрации
      программного обеспечения на ваше имя, вы даёте согласие на передачу ваших
      персональных данных. Сервис «Я<q-icon name="favorite" color="red" />ОФП»
      гарантирует, что правообладатель, дистрибьютор или реселлер программного обеспечения
      осуществляет защиту персональных данных на условиях, аналогичных изложенным в
      Политике конфиденциальности персональных данных.
    </div>
    <div class="q-my-md">
      Настоящее согласие распространяется на следующие Ваши персональные данные: фамилия,
      имя и отчество, адрес электронной почты, почтовый адрес доставки заказов, контактный
      телефон, платёжные реквизиты.
    </div>
    <div class="q-my-md">
      Срок действия согласия является неограниченным. Вы можете в любой момент отозвать
      настоящее согласие, направив письменное уведомления на электронный адрес с пометкой
      «Отзыв согласия на обработку персональных данных».
    </div>
    <div class="q-my-md">
      Обращаем ваше внимание, что отзыв согласия на обработку персональных данных влечёт
      за собой удаление Вашей учётной записи с Интернет-сайта (https://ofp.mamrukov.com),
      а также уничтожение записей, содержащих ваши персональные данные, в системах
      обработки персональных данных сервисом «Я<q-icon name="favorite" color="red" />ОФП»,
      что может сделать невозможным пользование сервисом «Я<q-icon
        name="favorite"
        color="red"
      />ОФП».
    </div>
    <div class="q-my-md">
      Гарантирую, что представленная мной информация является полной, точной и
      достоверной, а также что при представлении информации не нарушаются действующее
      законодательство Российской Федерации, законные права и интересы третьих лиц. Вся
      представленная информация заполнена мною в отношении себя лично.
    </div>
    <div class="q-my-md">
      Настоящее согласие действует в течение всего периода хранения персональных данных,
      если иное не предусмотрено законодательством Российской Федерации.
    </div>
  </div>
</template>

<script setup></script>

<style scoped></style>
